---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamCompressionPerpendicular
source: html/5d256bc4-e693-99ce-80b4-32c39f23ee9d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamCompressionPerpendicular Property

"Compression perpendicular to grain"

## Syntax (C#)
```csharp
public static ForgeTypeId PhyMaterialParamCompressionPerpendicular { get; }
```